#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
tf/env/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/tcry.pt/tcry.pt/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/tcry.pt/tcry.pt

To view this run in a browser, visit:
https://app.terraform.io/app/tcrypt/production-tcrypt/runs/run-kkuU8UfvPyQ6BkjS

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.tcrypt.data.template_file.cloud_init: Refreshing state... [id=5db985ed8a369b7a1098e0dcf68f946546a6b54de79a44060240c637b6f9bea4]
module.tcrypt.digitalocean_volume.storage_1: Refreshing state... [id=ebf89721-1338-11eb-9461-0a58ac1420e9]
module.tcrypt.digitalocean_vpc.region_1: Refreshing state... [id=2b0aaf42-a9b4-4226-aeb3-32acc2973103]
module.tcrypt.digitalocean_vpc.region_2: Refreshing state... [id=871ad150-ef6a-4af9-b6e0-160d67864baf]
module.tcrypt.digitalocean_droplet.compute_workers_region_1[0]: Refreshing state... [id=216478801]
module.tcrypt.digitalocean_droplet.compute_workers_region_1[1]: Refreshing state... [id=216478799]
module.tcrypt.digitalocean_droplet.compute_workers_region_2[0]: Refreshing state... [id=216479229]
module.tcrypt.digitalocean_floating_ip.proxy_1: Refreshing state... [id=167.172.9.215]
module.tcrypt.digitalocean_domain.root: Refreshing state... [id=tcry.pt]
module.tcrypt.digitalocean_record.mail_verification["1"]: Refreshing state... [id=120617220]
module.tcrypt.digitalocean_record.mail_cname["1"]: Refreshing state... [id=120617223]
module.tcrypt.digitalocean_record.mail_cname["2"]: Refreshing state... [id=120617222]
module.tcrypt.digitalocean_record.mail_mx["1"]: Refreshing state... [id=120617218]
module.tcrypt.digitalocean_record.mail_verification["0"]: Refreshing state... [id=120617225]
module.tcrypt.digitalocean_record.code: Refreshing state... [id=120617221]
module.tcrypt.digitalocean_record.mail_verification["2"]: Refreshing state... [id=120617226]
module.tcrypt.digitalocean_record.mail_mx["0"]: Refreshing state... [id=120617224]
module.tcrypt.digitalocean_record.mail_cname["0"]: Refreshing state... [id=120617219]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.tcrypt.digitalocean_droplet.compute_workers_region_1[0] will be updated in-place
  ~ resource "digitalocean_droplet" "compute_workers_region_1" {
        backups              = false
        created_at           = "2020-11-12T04:42:20Z"
        disk                 = 25
        id                   = "216478801"
        image                = "ubuntu-20-04-x64"
        ipv4_address         = "165.227.8.224"
        ipv4_address_private = "10.2.0.5"
        ipv6                 = true
        ipv6_address         = "2604:a880:2:d0::2094:d001"
        locked               = false
        memory               = 1024
        monitoring           = true
        name                 = "compute-worker-sfo2-1"
        price_hourly         = 0.00744
        price_monthly        = 5
        private_networking   = true
        region               = "sfo2"
        resize_disk          = true
        size                 = "s-1vcpu-1gb"
        status               = "active"
        tags                 = []
        urn                  = "do:droplet:216478801"
        user_data            = "9ecb6538e62b29cae58bc8869e0b8b1a21d06b9f"
        vcpus                = 1
      ~ volume_ids           = [] -> (known after apply)
        vpc_uuid             = "2b0aaf42-a9b4-4226-aeb3-32acc2973103"
    }

  # module.tcrypt.digitalocean_volume.region_1[0] will be created
  + resource "digitalocean_volume" "region_1" {
      + droplet_ids             = (known after apply)
      + filesystem_label        = (known after apply)
      + filesystem_type         = (known after apply)
      + id                      = (known after apply)
      + initial_filesystem_type = "ext4"
      + name                    = "storage-sfo2-1"
      + region                  = "sfo2"
      + size                    = 20
      + urn                     = (known after apply)
    }

  # module.tcrypt.digitalocean_volume.storage_1 will be destroyed
  - resource "digitalocean_volume" "storage_1" {
      - droplet_ids             = [] -> null
      - filesystem_type         = "ext4" -> null
      - id                      = "ebf89721-1338-11eb-9461-0a58ac1420e9" -> null
      - initial_filesystem_type = "ext4" -> null
      - name                    = "storage-1" -> null
      - region                  = "sfo2" -> null
      - size                    = 20 -> null
      - tags                    = [] -> null
      - urn                     = "do:volume:ebf89721-1338-11eb-9461-0a58ac1420e9" -> null
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>

*Pusher: @tyler-smith, Action: `pull_request`*